package com.example.myapplication.screens.home

import androidx.lifecycle.LiveData
import androidx.lifecycle.MutableLiveData
import androidx.lifecycle.ViewModel
import com.example.myapplication.database.Item

class HomeViewModel(val model: HomeModel) : ViewModel() {
    private var _items = MutableLiveData(mutableListOf<Item>())
    val items: LiveData<MutableList<Item>> = _items

    val database = listOf(
        Item(
            name = "Банк 4.0",
            author = "Бретт Кинг",
            description = "Банк келажаги аллақачон шу ерда — сиз тайёрмисиз?\n\nНақд пул аллақачон эскилик сарқитига айлангани кўпчилигимизга сир эмас. Бироқ пластик картанинг даври ҳам ўтганини биласизми? Тўлов тизимлари ва банк соҳасида инқилобий ўзгаришлар юз бермоқда. Келажакда маҳсулот сотиб олиш учун ғиштдай келадиган ҳамёнимизни чиқариб, банкноталарни санаб ўтирмаймиз, ҳатто чўнтагимиздаги картани кассирга узатишга ҳам ҳожат бўлмайди. Эҳтимол, телефонимиздаги илова ҳам керак бўлмас. Унда қандай тўлов қиламиз?\n\nБу ва бошқа кўплаб саволларга Бретт Кингнинг «Банк 4.0» китоби батафсил жавоб беради. Китоб бизни янги воқелик ва унинг ақл бовар қилмас истиқболлари билан таништиради. «Банк 4.0» нафақат молия ҳақида сўзлайди, унда келажагимизнинг фантастик фильмларга ўхшаш ёрқин манзараси тасвирланган. Эътиборлиси, Бретт Кинг тилга олган ўзгаришлар асло хом-хаёл эмас, ахир кўпи аллақачон амалга ошмоқда. Дунё тарихда кузатилмаган шиддат билан янгиланар экан, рақобатда ютқизмаслик учун бу эврилишлар моҳиятини тушуниш керак. Ушбу моҳият «Банк 4.0»да ранг-баранг мисоллар билан ёритилган.",
            price = 50000,
            rank = 5.0
        ),
        Item(
            name = "Мамлакатлар таназзули сабаблари",
            author = "Дарон Ажемўғли, Жеймс А. Робинсон",
            description = "Ажойиб ва қизиқарли ёзилган «Мамлакатлар таназзули сабаблари» асари асрлар давомида мутахассисларни ҳайратда қолдирган саволга ишончли ва изчил асосланган янги назария билан жавоб беради: Нега баъзи мамлакатлар бой ва бошқалар камбағал, бойлик ва қашшоқлик, соғлиқ ва касаллик, озиқ-овқат ва очарчилик бўйича бўлинган?",
            price = 50000,
            rank = 5.0
        ),
        Item(
            name = "Рақамлар учун яралган идрок",
            author = "Дарон Ажемўғли, Жеймс А. Робинсон",
            description = "Миянгиз ғаройиб қобилиятларга эга, афсуски, ундан самарали фойдаланиш учун қўлланма йўқ. Бу қўлланмани «Рақамлар учун яралган идрок» китобида топишингиз мумкин. Тажрибангиз бор ёки йўқлигидан қатъи назар, ушбу китобдан билим олиш кўникмаларингиз ва техникангизни ошириш учун янгича ва ажойиб усулларни топасиз. Улар, айниқса, математика ва табиий фанларни ўзлаштиришда қўл келади.",
            price = 50000,
            rank = 5.0
        ),
        Item(
            name = "Яланғоч иқтисодиёт",
            author = "Чарльз Уилан",
            description = "Чарльз Уиланнинг «Яланғоч иқтисодиёт» номли китобида иқтисодиётнинг моҳияти ҳамда долзарб масалалари содда ва тушунарли, барчамизга таниш ҳаётий мисоллар билан ёритилган. Китобда мураккаб чизмалар ёки сирли формулалар йўқ, балки моддият дунёсида қандай қонуниятлар ҳукмронлик қилиши ва давлатлар ниманинг ҳисобига бойиши тушунтирилган. Асарни ўқий бошлаганимизда муаллиф улкан иқтисодиёт оламидаги йўлбошчимизга айланиб, бу оламнинг энг чекка бурчакларигача биз билан саёҳат қилади. Уилан ‒ ишончли йўлбошчи, унинг биз билан олиб борадиган суҳбати эса самимий ва дўстона руҳда кечади.",
            price = 50000,
            rank = 5.0
        ),
    )

    init {
        if (model.isFirstRun()) addItems()
        getItems()
    }

    private fun getItems() {
        _items.value = model.getItems()
    }

    private fun addItems() {
        for (item in database) {
            model.addItem(item)
        }
    }
}